[
  {
    "title": "Cosmora Celestica (WIP)",
    "image": "./assets/img/projects/project7.png",
    "tech": "(WORK IN PROGRESS)",
    "video": "none",
    "youtube": "none",
    "team": "5 Person",
    "role": "Lead Developer",
    "purpose": "This project is an enhanced upgrade of my previous Neonrealm MVC Java project, developed as part of a rigorous Java MVC course assignment. With tight deadlines and concurrent academic commitments, the objective was to build a modern, secure, and user-friendly digital storefront specializing in games and gaming accessories. The focus was on implementing a robust MVC architecture, ensuring strong security measures, and delivering a seamless user experience within project constraints.",
    "description": "A work in progress project.",
    "githubLink": "https://github.com/AinzleKhoa/cosmora-celestica/",
    "downloadLink": "none",
    "websiteLink": "https://ainzlekhoa.github.io/cosmora-celestica/",
    "yearCompleted": "Second Year",
    "category": "website",
    "featured": "false"
  },
  {
    "title": "Personal Portfolio",
    "image": "./assets/img/projects/project6.png",
    "tech": "HTML, CSS, JavaScript, Bootstrap, GitHub Pages, JQuery, JSON",
    "video": "none",
    "youtube": "none",
    "team": "1 Person",
    "role": "Solo Developer",
    "purpose": "I built this portfolio completely from scratch to reflect both my web development skills and personal style. After four months of learning frontend development, I wanted a space that felt truly mine—simple, expressive, and built without relying on any templates or design platforms.",
    "description": "This project became a week-long passion where I designed and coded everything myself. Inspired by my love for space and the calming blue of the sky, the site blends clean structure with soft sci-fi aesthetics. Its more than a portfolio—its a personal introduction and a reflection of who I am as a developer.",
    "githubLink": "https://github.com/AinzleKhoa/portfolio",
    "downloadLink": "none",
    "websiteLink": "none",
    "yearCompleted": "Second Year",
    "category": "website",
    "featured": "false"
  },
  {
    "title": "FEL Club Website",
    "image": "./assets/img/projects/project2.png",
    "tech": "HTML, CSS, JavaScript, Bootstrap, GitHub Pages, JQuery, JSON",
    "video": "./assets/video/felwebsite.mp4",
    "youtube": "https://youtu.be/tHwyNQgeCSA",
    "team": "1 Person",
    "role": "Solo Developer",
    "purpose": "The FEL Club Website was created to provide an easy-to-update platform for the FPTU English Club. It was built to be simple, cost-effective, and manageable by the clubs members without requiring a domain or complex setup.",
    "description": "This frontend-only website showcases club events and activities, hosted on GitHub Pages for simplicity. Built using Bootstrap and custom HTML/CSS, the site dynamically pulls event data from a JSON file, allowing for easy future updates. I customized a free template to fit the clubs needs, focusing on a clean, user-friendly interface.",
    "githubLink": "https://github.com/AinzleKhoa/FEL",
    "downloadLink": "none",
    "websiteLink": "https://ainzlekhoa.github.io/FEL/",
    "yearCompleted": "Second Year",
    "category": "website",
    "featured": "true"
  },
  {
    "title": "NeonRealm",
    "image": "./assets/img/projects/project4.png",
    "tech": "Java Servlet & JSP (MVC), JSTL & EL, HTML, CSS, JavaScript, Bootstrap, Microsoft SQL Server, OAuth 2.0, Custom Tags & Filters, jBCrypt, Gson, Owl Carousel, NetBeans",
    "video": "./assets/video/neonrealm.mp4",
    "youtube": "https://youtu.be/TKT76zBKzNE",
    "team": "6 Person",
    "role": "As the team lead and primary developer, I handled both frontend and backend development. I designed the home and category pages, implemented the MVC model, and developed the sign-in/sign-up system with security features like brute force protection. Additionally, I integrated GitHub third-party login and managed the profile section for user settings. I led the team to a near-perfect score, achieving a 10 for my contributions.",
    "purpose": "This project was part of a Java MVC assignment, developed under tight deadlines while managing multiple other subjects. The goal was to build a digital game store with a secure and user-friendly platform. I re-modeled an existing template to meet project requirements and time constraints.",
    "description": "NeonRealm is a Java MVC-based digital game store website, using SQL Server for the database. It features secure user authentication, game browsing, and a user profile system. The project combined frontend design with backend logic to create a functional and interactive online store.",
    "githubLink": "https://github.com/AinzleKhoa/neonrealm-website",
    "downloadLink": "none",
    "websiteLink": "none",
    "yearCompleted": "Second Year",
    "category": "website",
    "featured": "false"
  },
  {
    "title": "Arduino Rover",
    "image": "./assets/img/projects/project3.png",
    "tech": "Arduino-powered autonomous rover with sensor integration, controlled by an ESP32 for advanced functionalities like mobile app control. Utilizes ultrasonic sensors for obstacle detection, motor drivers (L298N) for DC motor control, and servo motors for additional motion. Features an LCD1602 (I2C) for real-time status display. Software includes Arduino IDE for programming and C/C++ for control algorithms. Controlled remotely via the Dabble ESP32 app for manual and autonomous navigation.",
    "video": "./assets/video/arduinorover.mp4",
    "youtube": "https://youtu.be/8PMc3cc0UH8",
    "team": "2 Person",
    "role": "Collaborator in the design, programming, and wiring of the autonomous rover. I handled the block and schematic diagram designs, coded the logic, and contributed to connecting the hardware components.",
    "purpose": "The Arduino Rover project was originally conceived as a subject assignment, but evolved into a creative collaboration with a talented friend. My goal was to develop an autonomous rover capable of both manual control and auto-navigation using sensors. Despite being a challenging project with significant financial investment, it was a rewarding experience that allowed us to push the boundaries of our skills and creativity.",
    "description": "The Arduino Rover is an autonomous robot designed for manual and autonomous navigation, built using Arduino and sensor integration. The rover can be manually controlled or navigate on its own through environmental sensors, making it versatile for various applications. The project involved significant collaboration, combining my original idea with my friends detailed design work. Over time, we refined the rovers functionality and design, despite facing challenges like sourcing components, which required both time and substantial investment. This project was a rewarding hands-on experience in robotics, combining programming, hardware integration, and problem-solving skills.",
    "githubLink": "https://github.com/AinzleKhoa/arduino-rover",
    "downloadLink": "none",
    "websiteLink": "none",
    "yearCompleted": "Second Year",
    "category": "robot",
    "featured": "true"
  },
  {
    "title": "Galactic Typist",
    "image": "./assets/img/projects/project1.png",
    "tech": "Java, Swing, Java AWT, Multi-threading (ExecutorService), Timer API, Object-Oriented Programming, Custom GUI Components",
    "video": "./assets/video/galactictypist.mp4",
    "youtube": "https://youtu.be/VTaNIp9tMmo",
    "team": "1 Person",
    "role": "Solo Developer",
    "purpose": "Originally designed as a simple assignment, Galactic Typist evolved into a project driven by passion. Its primary goal is to help players improve their typing speed and accuracy through engaging gameplay. The game provides a fun and interactive way to practice typing while immersing players in a thrilling, sci-fi universe.",
    "description": "Galactic Typist is a fast-paced typing game where players defend Earth from the Voidlord, an alien empire determined to conquer the galaxy. Players control advanced Federation ships, using typing commands to shoot and dodge enemy fire. With each correct keystroke, players not only advance through the levels but also enhance their typing skills. The game features customizable challenges, making it a unique blend of education and entertainment.",
    "githubLink": "https://github.com/AinzleKhoa/galactic-typist",
    "downloadLink": "https://drive.google.com/file/d/11Z1HMWlTwL-56pKB-0OFu67yuUSfsYy1/view?usp=sharing",
    "websiteLink": "none",
    "yearCompleted": "First Year",
    "category": "game",
    "featured": "true"
  },
  {
    "title": "Student Management System",
    "image": "./assets/img/projects/project5.png",
    "tech": "Java, Swing, Java AWT, Object-Oriented Programming, Custom GUI Components",
    "video": "./assets/video/studentmanagementsystem.mp4",
    "youtube": "https://youtu.be/NmZCVKA0cPc",
    "team": "1 Person",
    "role": "Solo Developer",
    "purpose": "Developed as a solo project for a university assignment, originally intended to be a group project. The goal was to create a simple application to help teachers manage student information. While the design may seem basic, it serves its purpose well for the task at hand, and I was able to complete it within 4 days.",
    "description": "The Student Management System is a straightforward application built with Java and Swing, aimed at simplifying student data management for teachers. Despite its simple and old-school design, the system effectively manages essential student records. This project was completed during my first year at university as part of an assignment that I took on individually, and it taught me valuable lessons in time management and software development within a short time frame.",
    "githubLink": "https://github.com/AinzleKhoa/student_management_system",
    "downloadLink": "https://drive.google.com/file/d/17RNWSFROhCI-CH5FsKy_2ScWHNwbRad2/view?usp=sharing",
    "websiteLink": "none",
    "yearCompleted": "First Year",
    "category": "application",
    "featured": "false"
  }
]